c = []

3.times do
  c << gets.chomp.split(' ').map(&:to_i)
end

result = true

# cの1列目と2列目の差を比べる。
result = false if c[0][0] - c[0][1] != c[1][0] - c[1][1] || c[1][0] - c[1][1] != c[2][0] - c[2][1]
# cの2列目と3列目の差を比べる。
result = false if c[0][1] - c[0][2] != c[1][1] - c[1][2] || c[1][1] - c[1][2] != c[2][1] - c[2][2]

# cの1行目と2行目の差を比べる。
result = false if c[0][0] - c[1][0] != c[0][1] - c[1][1] || c[0][1] - c[1][1] != c[0][2] - c[1][2]

# cの2行目と3行目の差を比べる。
result = false if c[1][0] - c[2][0] != c[1][1] - c[2][1] || c[1][1] - c[2][1] != c[1][2] - c[2][2]

p result
